<!DOCTYPE html>
<html>
  <head>
    <title>Example</title>
  </head>
  <body>
    <?php

      $data = array(
        'webgl' => array(
          'title' => 'Компютърна графика с WebGL',
          'description' => 'След завършване на курса студентите ще могат да създават тримерни статични изображения и тримерни анимации.',
          'lecturer' => 'доц. П. Бойчев',
        ),
        'go' => array(
          'title' => 'Програмиране с Go',
          'description' => 'Целта на курса е да запознае студентите както с основите на програмния език Go, така и с неговата култура и обкръжение.',
          'lecturer' => 'Николай Бачийски',
        ),
        'font_end' => array(
          'title' => 'Разработка на Front-End Web',
          'description' => 'Курсът „Front-End Web Development” има за цел да запознае студентите с разработването на уеб приложения и използваните езици, библиотеки, инструменти и технологии.',
          'lecturer' => 'д-р Ст. Велев',
        ),
        'cloud' => array(
          'title' => 'Основи на разработката на приложения в облачна среда',
          'description' => 'Разработката на софтуер изисква както добро познаване и владеене на редица модели, методи, процеси, добри практики и инструменти, така и на платформите, върху които ще бъдат разгърнати готовите решения.',
          'lecturer' => 'доц. А. Семерджиев',
        ),
        'net_fund' => array(
          'title' => 'Основи на компютърните мрежи',
          'description' => 'Курсът дава възможност на студентите да усъвършенствуват своето образование и обучение в областта на компютърните мрежи. Съдържанието следва курса „Основи на компютърните мрежи” (Network Fundamentals) на Сиско.',
          'lecturer' => 'проф. д-р Красен Стефанов',
        ),
        'nosql' => array(
          'title' => 'Основи на NoSQL базите от данни с MongoDB',
          'description' => 'Курсът запознава студентите със съвременните NoSQL решения, техните теоретични основи, предимства и недостатъци.',
          'lecturer' => 'гл. ас. Калин Георгиев',
        ),
        'hp_prog' => array(
          'title' => 'Високо производително програмиране',
          'description' => 'Нуждата за високо ефективен софтуер расте - от една страна това е причинено от факта, че еднонишково процесорите практически спряха своето развитие и в резултат на това съществуващите еднонишкови компютърни програми вече не стават “автоматично” по-бързи само с подмяната на хардуер.',
          'lecturer' => 'Благовест Тасков',
        )
      );

      function show_page($pageId, $data){
        if(key_exists($pageId, $data))
          {
            $output = "<h1>";
            $output = $output.$data[$pageId]['title'];
            $output = $output."</h1>";

            $output = $output."<h2>";
            $output = $output.$data[$pageId]['lecturer'];
            $output = $output."</h2>";

            $output =  $output."<p>";
            $output = $output.$data[$pageId]['description'];
            $output = $output."</p>";
            return $output;
          }
       else
         {
           return "<p>Моля изберете курс</p>";
         }
       }



      show_page('webgl', $data);

    ?>
  </body>
</html>
