;1) Да се напише функция zad1 която приема като единствен параметър списък с
;числа и връща l1 - l2 + l3 .... Да не се използва if или степенуване за
;определяне на + или -
(define )

;2) Да се напише функция (calculate-list L) която пресмята списък със следният
;вид <елемент1> <функция|оператор1> <елемент2> ....

;3) (binary-tree-sort L)

;4) Да се напише функцията (subtree T root-val is-min) която намира в
;зададеното дърво поддърво с корен root-val и в зависимост от is-min
;върнатото поддърво трябва да е или най-малкото или най-голямото
